[
  {
    "projectName": "Human AI-Collaborative Systems Final Project ",
    "institutionName": "University of Notre Dame",
    "projectLocation": "Notre Dame, Indiana",
    "projectDates": "January 2024 – May 2024",
    "projectTitle": "Meal Maestro: AI Recipe Generator",
    "projectDescription": [
      "Using Node.js, my team and I built out a web app that takes images of a user’s fridge and ingredients, into recipes.",
      "Conducted needfinding research with the ultimate goal of finding a multimodal way for users to interact with AI.",
      "Stored user context (personal preferences, requests, and persistently stored allergies, likes and dislikes) in the backend.",
      "Used OpenAI’s API to send user input images, user context, and user specific requests. Fed OpenAI response into RecipeCard components for a streamlined Human-AI interaction."
    ]
  },
  {
    "projectName": "Modern Web Development Final Project",
    "institutionName": "University of Notre Dame",
    "projectLocation": "Notre Dame, Indiana",
    "projectDates": "September 2023 – December 2023",
    "projectTitle": "Study Buddy Connect: Student Collaboration Platform",
    "projectDescription": [
      "Developed a centralized platform, Study Buddy Connect, to address the challenges faced by students in finding suitable study partners, thus enhancing collaborative learning opportunities.",
      "Utilized React to build the website, providing persistent user storage through Back4App. Integrated a chat feature to facilitate communication between students, using Google Firebase’s Cloud Firestore.",
      "Find the project at: https://study-buddy-connect.vercel.app/"
    ],
    "pdfs":[
      "pdfs/Demo Day - Study Buddy Connect.pdf"
    ]
  },
  {
    "projectName": "Distributed Systems Final Project",
    "institutionName": "University of Notre Dame",
    "projectLocation": "Notre Dame, Indiana",
    "projectDates": "March 2023 – May 2023",
    "projectTitle": "SpoonNet: An Interactive Multiplayer Card Game",
    "projectDescription": [
      "Recreated the Spoons Card game with asynchronous client-server communication. Invoked remote procedure call using a custom client and server within Python.",
      "Worked with an event-driven server to ensure consistency and low latency of communication while using threading."
    ],
    "pdfs":[
      "pdfs/Final Distributed Project_ Spoons.pdf"
    ]
  },
  {
    "projectName": "Data Science Final Project",
    "institutionName": "University of Notre Dame",
    "projectLocation": "Notre Dame, Indiana",
    "projectDates": "September 2022 – December 2022",
    "projectTitle": "Predicting the Number of Starbucks Based on Geo-Economic Data",
    "projectDescription": [
      "Explored the relationship between geo-economic data and the number of Starbucks stores in a given zip code by training linear and non-linear models within Python. The data used had 13608 rows and 13 columns.",
      "Analyzed data using Naive-Bayes Classifier, and different forms of regression: Lasso, Support Vector, and K-Nearest Neighbors."
    ],
    "pdfs":[
      "pdfs/Predicting_the_Number_of_Starbucks_Based_on_Geo_Economic_Data.pdf"
    ]
  },
  {
    "projectName": "Data Structures Project",
    "institutionName": "University of Notre Dame",
    "projectLocation": "Notre Dame, Indiana",
    "projectDates": "March 2022 – May 2022",
    "projectTitle": "Predictive Recommendations based on Grocery Data",
    "projectDescription": [
      "Used mock grocery store loyalty card data to predict grocery coupons for customers based on their previous purchases.",
      "Added user input feature and was able to categorize the new data to give more recommended coupons to the user."
    ]
  },
  {
    "projectName": "Intro to Entrepreneurship Final Project",
    "institutionName": "University of Notre Dame",
    "projectLocation": "Notre Dame, Indiana",
    "projectDates": "September 2021 – December 2021",
    "projectTitle": "Level Measuring Set",
    "projectDescription": [
      "Prototyped and developed a business plan with my group for our idea: a measuring cup set for those with upper limb reductions.",
      "The final product was a sleek, stainless-steel measuring cup set that can be used easily with one hand, as the current products on the market look as if they belong in a hospital, not in a kitchen."
    ]
  },
  {
    "projectName": "High School Senior Project",
    "institutionName": "The Potomac School",
    "projectLocation": "McLean, Virginia",
    "projectDates": "April 2020 – May 2020",
    "projectTitle": "Learning Swift and Creating an App Interface",
    "projectDescription": [
      "Produced an interactive app interface after learning Swift. The app helps students take more organized notes in class by sorting photos from homework and classwork."
    ]
  }
]
